// Напишите программу, которая выводит случайное трёхзначное число и удаляет вторую цифру этого числа.
// 456 -> 46
// 782 -> 72
// 918 -> 98

int number = new Random().Next(1,1000);
Console.WriteLine(number);
Console.WriteLine(number /100 * 10 + number %10);